In [ ]:
# importando a biblioteca 
import pandas as pd

In [ ]:
# exemplo 1
nome = pd.Series(['João', 'Maria', 'Letícia','Roberto', 'Joaquim'])
altura = pd.Series([1.80, 1.79, 1.76, 1.81, 1.75], dtype='object')
idade = pd.Series([29, 24, 30, 20, 50], dtype='object')
matriculado = pd.Series([True, True, False, True, False], dtype='object')

In [ ]:
# instanciando os dados em um dataframe
df = pd.DataFrame({
    'nome': nome,
    'altura': altura,
    'idade': idade,
    'matriculado': matriculado
})

# imprimindo o dataframe criado
df

      nome altura idade matriculado
0     João    1.8    29        True
1    Maria   1.79    24        True
2  Letícia   1.76    30       False
3  Roberto   1.81    20        True
4  Joaquim   1.75    50       False

In [ ]:
# visualizando os tipos de dados no df
df.dtypes

nome           object
altura         object
idade          object
matriculado    object
dtype: object

In [ ]:
# realizando a transformação dos tipos de dados do df
novo_df = df.convert_dtypes(convert_boolean=False)
novo_df.dtypes

nome            string
altura         float64
idade            Int64
matriculado      Int64
dtype: object

In [ ]:
# visualizando o novo dataframe
novo_df

      nome  altura  idade  matriculado
0     João    1.80     29            1
1    Maria    1.79     24            1
2  Letícia    1.76     30            0
3  Roberto    1.81     20            1
4  Joaquim    1.75     50            0

In [ ]:
# exemplo 2
nome = pd.Series(['João', 'Maria', 'Letícia','Roberto', 'Joaquim'])
altura = pd.Series([1.80, 1.79, 1.76, 1.81, 1.75], dtype='object')
idade = pd.Series([29, 24, 30, 20, 50], dtype='object')
matriculado = pd.Series(['Sim', 'Sim', 'Não', 'Sim', 'Não'], dtype='object')

In [ ]:
# instanciando os dados em um dataframe
df = pd.DataFrame({
    'nome': nome,
    'altura': altura,
    'idade': idade,
    'matriculado': matriculado
})

# visualizando o dataframe criado
df

      nome altura idade matriculado
0     João    1.8    29         Sim
1    Maria   1.79    24         Sim
2  Letícia   1.76    30         Não
3  Roberto   1.81    20         Sim
4  Joaquim   1.75    50         Não

In [ ]:
# visualizando os tipos de dados presentes no dataframe
df.dtypes

nome           object
altura         object
idade          object
matriculado    object
dtype: object

In [ ]:
# realizando a conversão dos tipos de dados 
novo_df = df.convert_dtypes(convert_boolean=False)
novo_df.dtypes

nome            string
altura         float64
idade            Int64
matriculado     string
dtype: object

In [ ]:
# visualizando o novo dataframe
novo_df

      nome  altura  idade matriculado
0     João    1.80     29         Sim
1    Maria    1.79     24         Sim
2  Letícia    1.76     30         Não
3  Roberto    1.81     20         Sim
4  Joaquim    1.75     50         Não

In [ ]:
# excluindo a primeira coluna do "novo_df" e instanciando em uma nova variável
df_tratado = novo_df.iloc[:, 1:]

# visualizando o "df_tratado"
df_tratado

   altura  idade matriculado
0    1.80     29         Sim
1    1.79     24         Sim
2    1.76     30         Não
3    1.81     20         Sim
4    1.75     50         Não

In [ ]:
# visualizando o tipo de dado presente em cada coluna
# perceba que, na coluna "matriculado" o tipo de dado é uma "string"
df_tratado.dtypes

altura         float64
idade            Int64
matriculado     string
dtype: object

In [ ]:
# convertendo a variável categórica (da coluna "matriculado") para variável númerica
# 0: Não
# 1: Sim
for col in df_tratado.select_dtypes(include='string').columns:
  df_tratado[col] = df_tratado[col].astype('category')

  # imprimindo o mapeamento
  print(col, '\t', dict(enumerate(df_tratado[col].cat.categories)), end='\n\n')

  df_tratado[col] = df_tratado[col].cat.codes

matriculado 	 {0: 'Não', 1: 'Sim'}

In [ ]:
# visualizando o "df_tratado" após a conversão da variável categórica para númerica
df_tratado.head()

   altura  idade  matriculado
0    1.80     29            1
1    1.79     24            1
2    1.76     30            0
3    1.81     20            1
4    1.75     50            0

In [ ]:
# informações gerais do df
df_tratado.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   altura       5 non-null      float64
 1   idade        5 non-null      Int64
 2   matriculado  5 non-null      int8
dtypes: Int64(1), float64(1), int8(1)
memory usage: 218.0 bytes

In [ ]:
# visualizando o tipo de dado em cada coluna
df_tratado.dtypes

altura         float64
idade            Int64
matriculado       int8
dtype: object

In [ ]:
!pip install r-cran

ERROR: Could not find a version that satisfies the requirement r-cran (from versions: none)
ERROR: No matching distribution found for r-cran